
## Plan Result




<pre><code>Plan: 21 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.storage_account.azapi_update_resource.defender_settings
  * module.storage_account.time_rotating.rotate
  * module.storage_account.time_static.pim_expiry
  * module.storage_account.time_static.pim_start
  * module.storage_account_rd_commondata.azapi_update_resource.defender_settings
  * module.storage_account_rd_commondata.time_rotating.rotate
  * module.storage_account_rd_commondata.time_static.pim_expiry
  * module.storage_account_rd_commondata.time_static.pim_start
  * module.storage_account_rd_data_extract.azapi_update_resource.defender_settings
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_data_extract.time_rotating.rotate
  * module.storage_account_rd_data_extract.time_static.pim_expiry
  * module.storage_account_rd_data_extract.time_static.pim_start
  * module.storage_account_rd_location.azapi_update_resource.defender_settings
  * module.storage_account_rd_location.time_rotating.rotate
  * module.storage_account_rd_location.time_static.pim_expiry
  * module.storage_account_rd_location.time_static.pim_start
  * module.storage_account_rd_professional.azapi_update_resource.defender_settings
  * module.storage_account_rd_professional.time_rotating.rotate
  * module.storage_account_rd_professional.time_static.pim_expiry
  * module.storage_account_rd_professional.time_static.pim_start
* Update
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage_account_rd_commondata.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-11-10T13:44:21Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                           = "rd-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_commondata.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account_rd_commondata.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat"
        name                              = "rdcommondataaat"
        tags                              = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "staging"
            "managedBy"           = "ReferenceData"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "149.22.215.15",
              - "86.184.235.104",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_commondata.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_commondata.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_commondata.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_data_extract.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rddataextractaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + principal_id       = "1af59205-3568-496b-a1cc-87358714a358"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rddataextractaat"

      + schedule {
          + start_date_time = (known after apply)

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }
    }

  # module.storage_account_rd_data_extract.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_data_extract.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_data_extract.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_location.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdlocationaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account_rd_location.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_location.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_location.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_professional.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdprofessionalaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account_rd_professional.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_professional.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account_rd_professional.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 21 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":204,"Program":"tfcmt","SHA1":"","Vars":{}} -->